In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [8]:
inventories = '../data/inventory.csv'
inventory = pd.read_csv(inventories)
pd.set_option('display.max_columns', None)

inventory.head(10)

   inventory_id  film_id  store_id          last_update
0             1        1         1  2006-02-15 05:09:17
1             2        1         1  2006-02-15 05:09:17
2             3        1         1  2006-02-15 05:09:17
3             4        1         1  2006-02-15 05:09:17
4             5        1         2  2006-02-15 05:09:17
5             6        1         2  2006-02-15 05:09:17
6             7        1         2  2006-02-15 05:09:17
7             8        1         2  2006-02-15 05:09:17
8             9        2         2  2006-02-15 05:09:17
9            10        2         2  2006-02-15 05:09:17

In [9]:
inventory.film_id.value_counts()

1      8
127    8
73     8
174    8
86     8
      ..
62     2
53     2
52     2
196    2
223    2
Name: film_id, Length: 207, dtype: int64

In [5]:
inventory.shape

(1000, 13)

In [3]:
unique_inventory = inventory.nunique()
print(unique_inventory)

inventory_id    1000
film_id          207
store_id           2
last_update        1
dtype: int64

In [4]:
inventory.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   inventory_id  1000 non-null   int64
 1   film_id       1000 non-null   int64
 2   store_id      1000 non-null   int64
 3   last_update   1000 non-null   object
dtypes: int64(3), object(1)
memory usage: 97.8 KB

In [5]:
inventory.shape

(1000, 4)

In [6]:
inventory.set_index('inventory_id', inplace=True)

In [7]:
inventory.head()

              film_id  store_id          last_update
inventory_id
1                   1         1  2006-02-15 05:09:17
2                   1         1  2006-02-15 05:09:17
3                   1         1  2006-02-15 05:09:17
4                   1         1  2006-02-15 05:09:17
5                   1         2  2006-02-15 05:09:17

In [10]:
inventory.drop(["last_update"], axis=1, inplace=True)
inventory.head()

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1
2             3        1         1
3             4        1         1
4             5        1         2

In [11]:
rows_with_null = inventory.isnull().all(axis=1)

print(rows_with_null)

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool

In [ ]:
inventory.to_csv('filename.csv', index=False)